export const BackgroundPageMock = {
    "screenId": "backgroundSelection",
    "uuidSession": "22345200-abe8-4f60-90c8-0d43c5f6c0f6",
    "body": {
        "header": {
            "title": "Происхождение"
        }
    },
    "mainInfo": {
        "components": [
    {
        "backgroundId": 1,
        "title": "Артист",
        "image": "",
        "description": "Успешные артисты могут овладевать вниманием публики, поэтому у них яркий или напористый характер. Они могут быть романтичными, и в искусстве и красоте часто обращаются к возвышенным идеалам.",
        "detailedInfo": "https://dnd.su/backgrounds/757-entertainer/",
        "skill": "Выступая по вечерам в заведениях (таверна, трактир, цирк, театр или двордворянина), вы получаете бесплатный постой и еду. Это делает вас местной знаменитостью, и горожане, узнавшие вас, относятся к вам хорошо",
        "attainments": [
            "Акробатика",
            "Выступление"
        ],
        "instruments": [
            "Набор для грима",
            "Музыкальный инструмент"
        ],
        "equipment": [
            "Музыкальный инструмент",
            "Подарок от поклонницы",
            "Костюм",
            "Поясной кошель с 15 зм"
        ]
    },
    {
        "backgroundId": 2,
        "title": "Моряк",
        "image": "",
        "description": "Моряки бывают грубыми, но на их плечах лежит груз ответственности за сохранение жизни экипажа, поэтому на них можно положиться. Жизнь, проведённая на корабле, формирует их взгляды и самые важные привычки.",
        "detailedInfo": "https://dnd.su/backgrounds/761-sailor/",
        "skill": "Вы можете бесплатно плыть на знакомом корабле (вашем или союзном) для себя и спутников. Вы не выбираете маршрут и расписание – Мастер укажет время пути. Взамен вы и спутники должны помогать экипажу.",
        "attainments": [
            "Атлетика",
            "Восприятие"
        ],
        "instruments": [
            "Инструменты навигатора",
            "Водный транспорт"
        ],
        "equipment": [
            "Кофель-нагель (дубинка)",
            "50 футов шелковой веревки",
            "Талисман",
            "Комплект обычной одежды",
            "Поясной кошель с 10 зм"
        ]
    },
    {
        "backgroundId": 3,
        "title": "Пират",
        "image": "",
        "description": "Вы провели молодость среди жутких пиратов, безжалостных головорезов, научивших вас выживать среди акул и дикарей. Вы занимались грабежом в морях, и не одну душу отправили в солёную пучину. Вы хорошо знакомы со страхом и кровью, и заслужили сомнительную репутацию во многих портовых городах.",
        "detailedInfo": "https://dnd.su/backgrounds/770-pirate/",
        "skill": "Где бы вы ни оказались, вас боятся из-за вашей репутации. Находясь в цивилизованном поселении, вы можете безнаказанно совершать небольшие преступления, такие как отказ платить за еду в таверне или выламывание двери в магазине, так как жители боятся сообщать о вас властям.",
        "attainments": [
            "Атлетика",
            "Восприятие"
        ],
        "instruments": [
            "Инструменты навигатора",
            "Водный транспорт"
        ],
        "equipment": [
            "Кофель-нагель (дубинка)",
            "50 футов шелковой веревки",
            "Талисман",
            "Комплект обычной одежды",
            "Поясной кошель с 10 зм"
        ]
    },
    {
        "backgroundId": 4,
        "title": "Чужеземец",
        "image": "",
        "description": "Вы выросли вдали от цивилизации, среди дикой природы. Видели миграции стад, переживали экстремальные температуры и жили в полном одиночестве. Природа — в вашей крови, кем бы вы ни были: кочевником, исследователем или охотником. Даже в неизведанном вы находите знакомое.",
        "detailedInfo": "https://dnd.su/backgrounds/768-outlander/",
        "skill": "Вы хорошо запоминаете карты и местность, легко вспоминаете особенности окрестностей. Ежедневно можете добыть еду и воду для себя и пяти спутников, если ресурсы доступны.",
        "attainments": [
            "Атлетика",
            "Выживание"
        ],
        "instruments": [
            "Музыкальный инструмент"
        ],
        "equipment": [
            "Посох",
            "Капкан",
            "Трофей с убитолго животного",
            "Комплект доржной одежды",
            "Поясной кошель с 10 зм"
        ],
        "languages": [
            "Любой на ваш выбор"
        ]
    },
    {
        "backgroundId": 5,
        "title": "Беспризорник",
        "image": "",
        "description": "Вы выросли в бедности и одиночестве, сами заботясь о себе. Боролись за еду, спали где придётся, выживали без помощи. Благодаря сноровке и силе вы выбрались из нищеты. У вас есть немного денег — хватит на 10 дней. Как вы их получили и что изменило вашу жизнь?",
        "detailedInfo": "https://dnd.su/backgrounds/758-urchin/",
        "skill": "Вы знаете тайные лазы и проходы городских улиц, позволяющие пройти там, где другие не увидят пути. Вне боя вы (и ведомые вами союзники) можете перемещаться по городу вдвое быстрее обычного.",
        "attainments": [
            "Ловкость рук",
            "Скрытность"
        ],
        "instruments": [
            "Воровские инструменты",
            "Набор для грима"
        ],
        "equipment": [
            "Маленький нож",
            "Карта города, в котором вы выросли",
            "Ручная мышь",
            "Безделушка в память о родителях",
            "Комплект обычной одежды",
            "Поясной кошель с 10 зм"
        ]
    }
		]
    },
    "footer": {
        "components": [
            {
                "id": "rollBack",
                "title": "Назад",
                "actions": [
                    {
                        "method": "GET",
                        "href": "api/v1/character/creation/class"
                    },
                    {
                        "method": "DELETE",
                        "href": "api/v1/character/creation/class"
                    }
                ]
            },
            {
                "id": "character-sheet",
                "title": "К листу",
                "actions": [
                    {
                        "method": "GET",
                        "href": "/api/v1/character/creation/character-sheet"
                    }
                ]
            },
            {
                "id": "next",
                "title": "Далее",
                "actions": [
                    {
                        "method": "PATCH",
                        "href": "api/v1/character/creation/background"
                    },
                    {
                        "method": "GET",
                        "href": "api/v1/character/creation/characteristics"
                    }
                ]
            }
        ]
    }
}