export const ClassesPageMock = {
    "screenId": "classSelection",
    "uuidSession": "22345200-abe8-4f60-90c8-0d43c5f6c0f6",
    "body": {
    "header": {
        "title": "Выбор класса"
    }
},
    "mainInfo": {
    "components": [
        {
            "classId": 1,
            "title": "Чародей",
            "image": "/assets/classes/sorcerer.webp",
            "description": "Чародеи являются носителями магии, дарованной им при рождении их экзотической родословной, неким потусторонним влиянием или воздействием неизвестных вселенских сил. Никто не может обучиться чародейству, как, например, выучить язык, так же как никто не может обучить, как прожить легендарную жизнь. Никто не может избрать путь чародейства, сила сама выбирает носителя",
            "detailedInfo": "https://dnd.su/class/101-sorcerer/",
            "hits": "1d6",
            "skills": [
                {
                    "title": "Происхождение чародея",
                    "description": "Выберите источник, из которого ваш персонаж черпает свою силу."
                },
                {
                    "title": "Использование заклинаний",
                    "description": "Определённое событие в вашем прошлом или в жизни ваших родителей или предков оставило на вас неизгладимый отпечаток, связав вас с магией. Ваши заклинания питает некий источник магии, какого бы происхождения он не был."
                }
            ]
        },
        {
            "classId": 2,
            "title": "Волшебник",
            "image": "/assets/classes/wizard.webp",
            "description": "Находясь ли под предводительством могучего колдуна, или стараясь установить мир после многолетнего конфликта, орки и племена людей иногда заключали союзы, объединяя силы в огромные орды, терроризирующие более цивилизованные государства по соседству. Когда такие союзы скреплялись узами брака, появлялись полуорки. Некоторые полуорки возвышались, становясь гордыми вождями племён. Их человечья кровь давала им преимущество над их чистокровными соперниками. Другие отправлялись в мир, чтоб доказать своё превосходство над представителями более цивилизованных народов. Многие из них становились искателями приключений, достигая величия благодаря своим могучим свершениям, и дурной славы, благодаря варварским нравам и дикарской ярости",
            "detailedInfo": "https://dnd.su/class/105-wizard/",
            "hits": "1d6",
            "skills": [
                {
                    "title": "Магическое восстановление",
                    "description": "Вы знаете как восстанавливать часть магической энергии, изучая книгу заклинаний. Один раз в день, когда вы заканчиваете короткий отдых, вы можете восстановить часть использованных ячеек заклинаний. Ячейки заклинаний могут иметь суммарный уровень, который не превышает половину уровня вашего волшебника (округляя в большую сторону), и ни одна из ячеек не может быть шестого уровня или выше."
                },
                {
                    "title": "Книга заклинаний",
                    "description": "На 1-м уровне у вас есть книга заклинаний, содержащая шесть заклинаний волшебника 1-го уровня по вашему выбору. Ваша книга заклинаний является хранилищем известных вам заклинаний волшебника, за исключением заговоров, которые вы всегда помните."
                }
            ]
        },
        {
            "classId": 3,
            "title": "Воин",
            "image": "/assets/classes/fighter.webp",
            "description": "Опытный гладиатор сражается на арене, ловко используя трезубец и сеть, чтобы одолеть противника и порадовать толпу. Его враг сражается мечом, сверкающим молнией. Все они — воины: рыцари, завоеватели, чемпионы, наёмники и разбойники. Это мастера оружия, боя и доспехов, знакомые со смертью — как с чужой, так и со своей",
            "detailedInfo": "https://dnd.su/class/91-fighter/",
            "hits": "1d10",
            "skills": [
                {
                    "title": "Боевой стиль",
                    "description": "Вы выбираете боевой стиль, соответствующий вашей специализации. Выберите один из следующих вариантов. Вы не можете выбирать один и тот же вариант боевого стиля, даже если позже у вас будет возможность выбрать еще один стиль.\n" +
                        "\n" +
                        "Дуэлянт\n" +
                        "Пока вы держите рукопашное оружие в одной руке и не используете другого оружия, вы получаете бонус +2 к броскам урона этим оружием.\n" +
                        "\n" +
                        "Защита\n" +
                        "Если существо, которое вы видите, атакует не вас, а другое существо, находящееся в пределах 5 футов от вас, вы можете реакцией создать помеху его броску атаки. Для этого вы должны использовать щит.\n" +
                        "\n" +
                        "Оборона\n" +
                        "Пока вы носите доспехи, вы получаете бонус +1 к КД.\n" +
                        "\n" +
                        "Сражение большим оружием\n" +
                        "Если у вас выпало «1» или «2» на кости урона при атаке, которую вы совершали рукопашным оружием, удерживая его двумя руками, то вы можете перебросить эту кость, и должны использовать новый результат, даже если снова выпало «1» или «2». Чтобы воспользоваться этим преимуществом, ваше оружие должно иметь свойство «двуручное» или «универсальное».\n" +
                        "\n" +
                        "Сражение двумя оружиями\n" +
                        "Если вы сражаетесь двумя оружиями, вы можете добавить модификатор характеристики к урону от второй атаки.\n" +
                        "\n" +
                        "Стрельба\n" +
                        "Вы получаете бонус +2 к броску атаки, когда атакуете дальнобойным оружием."
                },
                {
                    "title": "Второе дыхание",
                    "description": "Вы обладаете ограниченным источником выносливости, которым можете воспользоваться, чтобы уберечь себя. В свой ход вы можете бонусным действием восстановить хиты в размере 1к10 + ваш уровень воина.\n" +
                        "\n" +
                        "Использовав это умение, вы должны завершить короткий либо продолжительный отдых, чтобы получить возможность использовать его снова."
                }
            ]
        },
        {
            "classId": 4,
            "title": "Плут",
            "image": "/assets/classes/rogue.webp",
            "description": "Плуты полагаются на мастерство, скрытность и уязвимые места врагов, чтобы взять верх в любой ситуации. У них достаточно сноровки для нахождения решения в любой ситуации, демонстрируя находчивость и гибкость, которые являются краеугольным камнем любой успешной группы искателей приключений.",
            "detailedInfo": "https://dnd.su/class/99-rogue/",
            "hits": "1d8",
            "skills": [
                {
                    "title": "Компетентность",
                    "description": "Выберите два ваших владения в навыках или одно владение навыком и владение воровскими инструментами. Ваш бонус мастерства удваивается для всех проверок характеристик, которые вы совершаете, используя любое из выбранных владений."
                },
                {
                    "title": "Скрытая атака",
                    "description": "Вы знаете, как точно наносить удар и использовать отвлечение врага. Один раз в ход вы можете причинить дополнительные 1к6 урона одному из существ, по которому вы попали атакой, совершённой с преимуществом. Атака должна использовать дальнобойное оружие или оружие со свойством «фехтовальное». Вам не нужно иметь преимущество при броске атаки, если другой враг цели находится в пределах 5 футов от неё. Этот враг не должен быть недееспособным, и у вас не должно быть помехи для броска атаки."
                },
                {
                    "title": "Воровской жаргон",
                    "description": "Во время плутовского обучения вы выучили воровской жаргон, тайную смесь диалекта, жаргона и шифра, который позволяет скрывать сообщения в, казалось бы, обычном разговоре. Только другое существо, знающее воровской жаргон, понимает такие сообщения. Это занимает в четыре раза больше времени, нежели передача тех же слов прямым текстом. Кроме того, вы понимаете набор секретных знаков и символов, используемый для передачи коротких и простых сообщений. Например, является ли область опасной или территорией гильдии воров, находится ли поблизости добыча, простодушны ли люди в округе, и предоставляют ли здесь безопасное убежище для воров в бегах."
                }
            ]
        },
        {
            "classId": 5,
            "title": "Следопыт",
            "image": "/assets/classes/ranger.webp",
            "description": "Вдали от суеты городов и посёлков, за изгородями, которые защищают самые далёкие фермы от ужасов дикой природы, среди плотно стоящих деревьев, беспутья лесов и на просторах необъятных равнин следопыты несут свой бесконечный дозор.",
            "detailedInfo": "https://dnd.su/class/97-ranger/",
            "hits": "1d10",
            "skills": [
                {
                    "title": "Избранный враг",
                    "description": "У вас есть значительный опыт изучения, отслеживания, охоты и даже общения с определённым видом врагов.\n" +
                        "\n" +
                        "Выберите вид избранного врага: Аберрации, Великаны, Драконы, Звери, Исчадия, Конструкты, Монстры, Небожители, Нежить, Растения, Слизи, Феи или Элементали. В качестве альтернативы вы можете выбрать в качестве избранных врагов две гуманоидные расы (например, гноллов и орков).\n" +
                        "\n" +
                        "Вы совершаете с преимуществом проверки Мудрости (Выживание) для выслеживания избранных врагов, а также проверки Интеллекта для вспоминания информации о них.\n" +
                        "\n" +
                        "Когда вы получаете это умение, вы также обучаетесь одному из языков, на котором говорит ваш избранный враг, если он вообще умеет говорить."
                },
                {
                    "title": "Исследователь природы",
                    "description": "Вы очень хорошо знакомы с одним видом природной среды и имеете большой опыт путешествий и выживания в регионах с таким климатом. Выберите один вид известной местности: Арктика, болота, горы, леса, луга, побережье, Подземье или пустыня. Когда вы совершаете проверку Интеллекта или Мудрости, связанную с известной вам местностью, ваш бонус мастерства удваивается, если вы используете навык, которым владеете.\n" +
                        "\n" +
                        "Путешествуя по избранной вами местности в течение часа или более, вы получаете следующие преимущества:\n" +
                        "\n" +
                        "Труднопроходимая местность не замедляет путешествие группы.\n" +
                        "Ваша группа не может заблудиться, кроме как по вине магии.\n" +
                        "Даже когда вы занимаетесь другой деятельностью во время путешествия (например, ищете пищу, ориентируетесь или занимаетесь выслеживанием), вы остаётесь готовы к опасности.\n" +
                        "Если вы путешествуете в одиночку, вы можете перемещаться скрытно в нормальном темпе.\n" +
                        "Когда вы ищете пищу, то находите в два раза больше, чем обычно.\n" +
                        "Когда вы выслеживаете других существ, вы также узнаёте их точное количество, их размеры, и как давно они прошли через область. "
                }
            ]
        },
        {
            "classId": 6,
            "title": "Варвар",
            "image": "/assets/classes/barbarian.webp",
            "description": "Всех варваров объединяет ярость — дикая, неукротимая, как шторм или хищник в бою. Для одних она связана с духами зверей, для других — с гневом на жестокий мир. Но для всех это источник силы, стойкости и боевого безумия.",
            "detailedInfo": "https://dnd.su/class/87-barbarian/",
            "hits": "1d12",
            "skills": [
                {
                    "title": "Защита без доспехов",
                    "description": "Если вы не носите доспехов, ваш Класс Доспеха равен 10 + модификатор Ловкости + модификатор Телосложения. Вы можете использовать щит, не теряя этого преимущества."
                },
                {
                    "title": "Ярость",
                    "description": "В бою вы сражаетесь с первобытной свирепостью. В свой ход вы можете бонусным действием войти в состояние ярости.\n" +
                        "\n" +
                        "В состоянии ярости вы получаете следующие преимущества, если не носите тяжёлый доспех:\n" +
                        "\n" +
                        "Вы совершаете с преимуществом проверки и спасброски Силы.\n" +
                        "Если вы совершаете рукопашную атаку оружием, используя Силу, вы получаете бонус к броску урона, соответствующий вашему уровню варвара, как показано в колонке «урон ярости» таблицы «Варвар».\n" +
                        "Вы получаете сопротивление дробящему, колющему и рубящему урону.\n" +
                        "Если вы способны накладывать заклинания, то вы не можете накладывать или концентрироваться на заклинаниях, пока находитесь в состоянии ярости.\n" +
                        "\n" +
                        "Ваша ярость длится 1 минуту. Она прекращается раньше, если вы потеряли сознание или если вы закончили свой ход, не получив урон или не атаковав враждебное по отношению к вам существо с момента окончания вашего прошлого хода. Также вы можете прекратить свою ярость бонусным действием.\n" +
                        "\n" +
                        "Если вы впадали в состояние ярости максимальное для вашего уровня количество раз (смотрите колонку «ярость»), то вы должны совершить продолжительный отдых, прежде чем сможете использовать ярость ещё раз."
                }
            ]
        }
    ]
},
    "footer": {
    "components": [
        {
            "id": "rollBack",
            "title": "Назад",
            "actions": [
                {
                    "method": "GET",
                    "href": "api/v1/character/creation/race"
                },
                {
                    "method": "DELETE",
                    "href": "api/v1/character/creation/race"
                }
            ]
        },
        {
            "id": "character-sheet",
            "title": "К листу",
            "actions": [
                {
                    "method": "GET",
                    "href": "/api/v1/character/creation/character-sheet"
                }
            ]
        },
        {
            "id": "next",
            "title": "Далее",
            "actions": [
                {
                    "method": "PATCH",
                    "href": "api/v1/character/creation/class"
                },
                {
                    "method": "GET",
                    "href": "api/v1/character/creation/background"
                }
            ]
        }
    ]
}
}