export const SpeciesPageMock = {
    "screenId": "raceSelection",
    "uuidSession": "22345200-abe8-4f60-90c8-0d43c5f6c0f6",
    "body": {
    "header": {
        "title": "Выбор расы"
    }
},
    "mainInfo": {
    "components": [
        {
            "raceId": 1,
            "title": "Тифлинг",
            "image": "/assets/species/tiefling.webp",
            "subcomponents": [
                {
                    "subRaceId": 1,
                    "title": "Тифлинг Асмодея",
                    "chars": [
                        {
                            "value": 1,
                            "title": "Интеллект"
                        },
                        {
                            "value": 2,
                            "title": "Харизма"
                        }
                    ],
                    "description": "Тифлинги, связанные с Нессусом, повелевают силами огня и тьмы, ведомые более острым, чем у других, интеллектом, как и подобает тем, кто связан с самим Асмодеем. Эти тифлинги используют «Увеличение характеристик» и «Дьявольское Наследие» из «Книги игрока».",
                    "abilities": [
                        {
                            "title": "Тёмное зрение",
                            "description": "Благодаря вашему дьявольскому наследию, вы отлично видите при тусклом свете и в темноте. На расстоянии в 60 футов вы при тусклом освещении можете видеть так, как будто это яркое освещение, и в темноте так, как будто это тусклое освещение. В темноте вы не можете различать цвета, только оттенки серого."
                        },
                        {
                            "title": "Адское сопротивление",
                            "description": "Вы получаете сопротивление урону огнём."
                        },
                        {
                            "title": "Дьявольское наследие",
                            "description": "Начиная с 3-го уровня, вы можете накладывать адское возмездие [hellish rebuke] как заклинание 2-го уровня с помощью этой особенности. Начиная с 5-го уровня, вы также можете накладывать заклинание тьма [darkness] с помощью этой особенности. После накладывания одного из этих заклинаний с помощью особенности вы должны закончить продолжительный отдых, прежде чем сможете вновь наложить его таким образом."
                        },
                    ]
                },
                {
                    "subRaceId": 2,
                    "title": "Тифлинг Зариэля",
                    "chars": [
                        {
                            "value": 2,
                            "title": "Харизма"
                        },
                        {
                            "value": 1,
                            "title": "Сила"
                        }
                    ],
                    "description": "Тифлинги, имеющие кровную связь с Зариэль, физически сильнее прочих тифлингов и получают полезные в бою магические способности.",
                    "abilities": [
                        {
                            "title": "Тёмное зрение",
                            "description": "Благодаря вашему дьявольскому наследию, вы отлично видите при тусклом свете и в темноте. На расстоянии в 60 футов вы при тусклом освещении можете видеть так, как будто это яркое освещение, и в темноте так, как будто это тусклое освещение. В темноте вы не можете различать цвета, только оттенки серого."
                        },
                        {
                            "title": "Адское сопротивление",
                            "description": "Вы получаете сопротивление урону огнём."
                        },
                        {
                            "title": "Наследие Авернуса",
                            "description": "Начиная с 3-го уровня, вы можете накладывать палящую кару [searing smite] как заклинание 2-го уровня с помощью этой особенности. Начиная с 5-го уровня, вы также можете накладывать заклинание клеймящая кара [branding smite] с помощью этой особенности. После накладывания одного из этих заклинаний с помощью особенности вы должны закончить продолжительный отдых, прежде чем сможете вновь наложить его таким образом."
                        },
                    ]
                },
                {
                    "subRaceId": 3,
                    "title": "Тифлинг Мефистофеля",
                    "chars": [
                        {
                            "value": 2,
                            "title": "Харизма"
                        },
                        {
                            "value": 1,
                            "title": "Интеллект"
                        }
                    ],
                    "description": "В ледяном царстве Кании Мефистофель даёт магическую силу всем, кто будет ему молиться. Связанные с ним тифлинги немного владеют тайной магией.",
                    "abilities": [
                        {
                            "title": "Тёмное зрение",
                            "description": "Благодаря вашему дьявольскому наследию, вы отлично видите при тусклом свете и в темноте. На расстоянии в 60 футов вы при тусклом освещении можете видеть так, как будто это яркое освещение, и в темноте так, как будто это тусклое освещение. В темноте вы не можете различать цвета, только оттенки серого."
                        },
                        {
                            "title": "Адское сопротивление",
                            "description": "Вы получаете сопротивление урону огнём."
                        },
                        {
                            "title": "Наследие Кании",
                            "description": "Начиная с 3-го уровня, вы можете накладывать огненные ладони [burning hands] как заклинание 2-го уровня с помощью этой особенности. Начиная с 5-го уровня, вы также можете накладывать заклинание горящий клинок [flame blade] с помощью этой особенности. После накладывания одного из этих заклинаний с помощью особенности вы должны закончить продолжительный отдых, прежде чем сможете вновь наложить его таким образом."
                        },
                    ]
                },

            ]
        },
        {
            "raceId": 2,
            "title": "Полурослик",
            "image": "/assets/species/halfling.webp",
            "subcomponents": [
                {
                    "subRaceId": 4,
                    "title": "Коренастый",
                    "chars": [
                        {
                            "value": 1,
                            "title": "Телосложение"
                        }
                    ],
                    "description": "Коренастые полурослики выносливее других и обладают некоторой устойчивостью к ядам. Поговаривают, что в их жилах течёт толика дварфской крови. В мире Забытых Королевств таких полуросликов зовут сильными сердцем, и чаще всего они встречаются на юге",
                    "abilities": [
                        {
                            "title": "Везучий",
                            "description": "Если при броске атаки, проверке характеристики или спасброске у вас выпало «1», вы можете перебросить кость, и должны использовать новый результат, даже если это «1»."
                        },
                        {
                            "title": "Храбрый",
                            "description": "Вы совершаете с преимуществом спасброски от состояния испуганный."
                        },
                        {
                            "title": "Проворство полуросликов",
                            "description": "Вы можете проходить сквозь пространство, занятое существами, чей размер больше вашего."
                        },
                        {
                            "title": "Устойчивость коренастых",
                            "description": "Вы совершаете с преимуществом спасброски от яда, и вы получаете сопротивление урону ядом"
                        }
                    ]
                },
                {
                    "subRaceId": 5,
                    "title": "Легконогий",
                    "chars": [
                        {
                            "value": 1,
                            "title": "Харизма"
                        }
                    ],
                    "description": "Легконогие полурослики умеют отлично скрываться, в том числе используя других существ как укрытие. Они приветливы и хорошо ладят с другими. В мире Забытых Королевств легконогие являются самой распространённой ветвью полуросликов. Легконогие более других склонны к перемене мест, и часто селятся по соседству с другими народами, или ведут кочевую жизнь. В мире Серого Ястреба таких полуросликов называют мохноногими или великанчиками",
                    "abilities": [
                        {
                            "title": "Везучий",
                            "description": "Если при броске атаки, проверке характеристики или спасброске у вас выпало «1», вы можете перебросить кость, и должны использовать новый результат, даже если это «1»."
                        },
                        {
                            "title": "Храбрый",
                            "description": "Вы совершаете с преимуществом спасброски от состояния испуганный."
                        },
                        {
                            "title": "Проворство полуросликов",
                            "description": "Вы можете проходить сквозь пространство, занятое существами, чей размер больше вашего."
                        },
                        {
                            "title": "Естественная скрытность",
                            "description": "Вы можете предпринять попытку скрыться даже если заслонены только существом, превосходящими вас в размере как минимум на одну категорию"
                        }
                    ]
                }
            ]
        },
        {
            "raceId": 3,
            "title": "Эльф",
            "image": "/assets/species/elf.webp",
            "subcomponents": [
                {
                    "subRaceId": 6,
                    "title": "Высший эльф",
                    "chars": [
                        {
                            "value": 1,
                            "title": "Интеллект"
                        }
                    ],
                    "description": "Поскольку вы — высший эльф, у вас острый ум и вы знакомы, по крайней мере, с основами магии. Во многих мирах D&D существует два вида высших эльфов. Один вид (который включает серых эльфов и эльфов долин Серого Ястреба, сильванести Саги о Копье и солнечных эльфов Забытых Королевств) высокомерен и замкнут, считая себя выше не-эльфов и даже других эльфов. Другой вид (включающий высших эльфов Серого Ястреба, квалинести из Саги о Копье и лунных эльфов из Забытых Королевств) более распространён и дружелюбен, и часто встречается среди людей и других рас. У солнечных эльфов Фаэруна (также называемых золотыми эльфами или эльфами восхода) бронзовая кожа и волосы медного, чёрного или золотистого оттенка. У них золотые, серебристые или чёрные глаза. Лунные эльфы (также называемые серебряными или серыми эльфами) гораздо бледнее, с алебастровой кожей, имеющей иногда оттенок синего. У них часто серебристо-белые, чёрные или синие волосы, но и различные оттенки светлых, коричневых и рыжих тонов также не являются редкими. У них синие или зелёные глаза с золотыми вкраплениями",
                    "abilities": [
                        {
                            "title": "Тёмное зрение",
                            "description": "Привыкнув к сумраку леса и ночному небу, вы обладаете превосходным зрением в темноте и при тусклом освещении. На расстоянии в 60 футов вы при тусклом освещении можете видеть так, как будто это яркое освещение, и в темноте так, как будто это тусклое освещение. В темноте вы не можете различать цвета, только оттенки серого."
                        },
                        {
                            "title": "Обострённые чувства",
                            "description": "Вы владеете навыком Восприятие."
                        },
                        {
                            "title": "Наследие фей",
                            "description": "Вы совершаете с преимуществом спасброски от состояния «очарованный», и вас невозможно магически усыпить."
                        },
                        {
                            "title": "Транс",
                            "description": "Эльфы не нуждаются во сне. Вместо этого они погружаются в глубокую медитацию, находясь в полубессознательном состоянии до 4 часов в сутки (обычно такую медитацию называют трансом). Во время этой медитации вы можете грезить о разных вещах. Некоторые из этих грёз являются ментальными упражнениями, выработанными за годы тренировок. После такого отдыха вы получаете все преимущества, которые получает человек после 8 часов сна."
                        },
                        {
                            "title": "Заговор",
                            "description": "Вы знаете один заговор из списка заклинаний волшебника. Базовой характеристикой заклинаний для его использования является Интеллект."
                        }
                    ]
                },
                {
                    "subRaceId": 7,
                    "title": "Лесной эльф",
                    "chars": [
                        {
                            "value": 1,
                            "title": "Интеллект"
                        }
                    ],
                    "description": "Поскольку вы — лесной эльф, у вас обострённые чувства и интуиция, и ваши стремительные ноги несут вас быстро и незаметно через ваши родные леса. Эта категория включает диких эльфов Серого Ястреба и кагонести из Саги о Копье, а также расы, называемые лесными эльфами Серого Ястреба и Забытых Королевств. В Фаэруне лесные эльфы (также называемые дикими или зелёными) являются затворниками, не доверяющими не-эльфам. Кожа лесных эльфов, как правило, имеет медный оттенок, иногда со следами зелёного. У них часто коричневые и чёрные волосы, но иногда они бывают светлого или бронзового оттенков. У них зелёные, карие или орехового цвета глаза.",
                    "abilities": [
                        {
                            "title": "Тёмное зрение",
                            "description": "Привыкнув к сумраку леса и ночному небу, вы обладаете превосходным зрением в темноте и при тусклом освещении. На расстоянии в 60 футов вы при тусклом освещении можете видеть так, как будто это яркое освещение, и в темноте так, как будто это тусклое освещение. В темноте вы не можете различать цвета, только оттенки серого."
                        },
                        {
                            "title": "Обострённые чувства",
                            "description": "Вы владеете навыком Восприятие."
                        },
                        {
                            "title": "Наследие фей",
                            "description": "Вы совершаете с преимуществом спасброски от состояния «очарованный», и вас невозможно магически усыпить."
                        },
                        {
                            "title": "Транс",
                            "description": "Эльфы не нуждаются во сне. Вместо этого они погружаются в глубокую медитацию, находясь в полубессознательном состоянии до 4 часов в сутки (обычно такую медитацию называют трансом). Во время этой медитации вы можете грезить о разных вещах. Некоторые из этих грёз являются ментальными упражнениями, выработанными за годы тренировок. После такого отдыха вы получаете все преимущества, которые получает человек после 8 часов сна."
                        },
                        {
                            "title": "Быстрые ноги",
                            "description": "Ваша базовая скорость ходьбы увеличивается до 35 футов."
                        },
                        {
                            "title": "Маскировка в дикой местности",
                            "description": "Вы можете предпринять попытку спрятаться, даже если вы слабо заслонены листвой, сильным дождём, снегопадом, туманом или другими природными явлениями."
                        }
                    ]
                }
            ]
        },
        {
            "raceId": 4,
            "title": "Полуорк",
            "image": "/assets/species/halfOrc.webp",
            "subcomponents": [
                {
                    "subRaceId": 8,
                    "title": "Полуорк",
                    "chars": [
                        {
                            "value": 2,
                            "title": "Сила"
                        },
                        {
                            "value": 1,
                            "title": "Телосложение"
                        }
                    ],
                    "description": "Находясь ли под предводительством могучего колдуна, или стараясь установить мир после многолетнего конфликта, орки и племена людей иногда заключали союзы, объединяя силы в огромные орды, терроризирующие более цивилизованные государства по соседству. Когда такие союзы скреплялись узами брака, появлялись полуорки. Некоторые полуорки возвышались, становясь гордыми вождями племён. Их человечья кровь давала им преимущество над их чистокровными соперниками. Другие отправлялись в мир, чтоб доказать своё превосходство над представителями более цивилизованных народов.",
                    "abilities": [
                        {
                            "title": "Тёмное зрение",
                            "description": "Благодаря орочьей крови, вы обладаете превосходным зрением в темноте и при тусклом освещении. На расстоянии в 60 футов вы при тусклом освещении можете видеть так, как будто это яркое освещение, и в темноте так, как будто это тусклое освещение. В темноте вы не можете различать цвета, только оттенки серого."
                        },
                        {
                            "title": "Угрожающий вид",
                            "description": "Вы получаете владение навыком Запугивание."
                        },
                        {
                            "title": "Непоколебимая стойкость",
                            "description": "Если ваши хиты опустились до нуля, но вы при этом не убиты, ваши хиты вместо этого опускаются до 1. Вы не можете использовать эту способность снова, пока не завершите продолжительный отдых."
                        },
                        {
                            "title": "Свирепые атаки",
                            "description": "Если вы совершили критическое попадание рукопашной атакой оружием, вы можете добавить к итоговому урону еще одну кость урона этого оружия."
                        }
                    ]
                }
            ]
        },
        {
            "raceId": 5,
            "title": "Человек",
            "image": "/assets/species/human.webp",
            "subcomponents": [
                {
                    "subRaceId": 9,
                    "title": "Человек",
                    "chars": [
                        {
                            "value": 1,
                            "title": "Сила"
                        },
                        {
                            "value": 1,
                            "title": "Ловкость"
                        },
                        {
                            "value": 1,
                            "title": "Телосложение"
                        },
                        {
                            "value": 1,
                            "title": "Интеллект"
                        },
                        {
                            "value": 1,
                            "title": "Мудрость"
                        },
                        {
                            "value": 1,
                            "title": "Харизма"
                        }
                    ],
                    "description": "В большинстве миров люди — это самая молодая из распространённых рас. Они поздно вышли на мировую сцену и живут намного меньше, чем дварфы, эльфы и драконы. Возможно, именно краткость их жизней заставляет их стремиться достигнуть как можно большего в отведённый им срок. А быть может, они хотят что-то доказать старшим расам, и поэтому создают могучие империи, основанные на завоеваниях и торговле. Что бы ни двигало ими, люди всегда были инноваторами и пионерами во всех мирах.",
                    "abilities": [
                        {
                            "title": "Разнообразие во всем",
                            "description": "Люди являются самым приспособленным и амбициозным народом среди распространённых рас. Их вкусы, нравы и обычаи сильно отличаются во множестве разных земель, где они поселились. Однако там, где они селятся, они остаются надолго: строят города, стоящие веками, и великие королевства, сохраняющиеся множество столетий. У отдельного человека может быть относительно короткая продолжительность жизни, но человеческая нация и культура сохраняет традиции от своих истоков на время, намного превышающее память одного человека. Они живут сегодняшним днём, что весьма хорошо подходит для приключенческой жизни, и позволяет вдобавок строить планы на будущее, со стремлением оставить после себя прочное наследие. Индивидуально или в группах, люди легко приспосабливаются к ситуации, и всегда остаются внимательными к изменяющейся политической и социальной динамике."
                        }
                    ]
                }
            ]
        }
    ],
        "footer": {
        "components": [
            {
                "componentId": "rollBack",
                "title": "Назад",
                "actions": [
                    {
                        "method": "GET",
                        "href": "/api/v1/character/creation/name"
                    },
                    {
                        "method": "DELETE",
                        "href": "/api/v1/character/creation/name"
                    }
                ]
            },
            {
                "componentId": "character-sheet",
                "title": "К листу",
                "actions": [
                    {
                        "method": "GET",
                        "href": "/api/v1/character/creation/character-sheet"
                    }
                ]
            },
            {
                "componentId": "next",
                "title": "Далее",
                "actions": [
                    {
                        "method": "PATCH",
                        "href": "/api/v1/character/creation/race"
                    },
                    {
                        "method": "GET",
                        "href": "/api/v1/character/creation/class"
                    }
                ]
            }
        ]
    }
}
}